

{
    "csse": [
      
        {
           "time": "2:00-2:15",
           "projectId": "csse-6-200",
           "title": "Redesigning: Developmental and Behavioral Pediatrics (DBP) Online Portal",
           "studentName": "Vi Le",
           "studentMajor": "CSSE",
           "projectType": "Faculty research",
           "facultyAdvisor": "Dr. Annuska Zolyomi",
           "posterLink": "./posters/csse/ViLe-Poster.jpg",
           "abstract": "In this project, I took over the front-end task of Developmental and Behavioral Pediatrics (DBP). The main aim of the project was to enhance user experience and accessibility for a range of users including clinicians, educators and families looking for health resources.\n\n I initiated the front-end development from scratch. Since starting a project is more challenging than the actual work, I put significant effort in researching the right framework and tools. I selected Next.js as the foundational framework because it was known for its server-side rendering capabilities, which native React lacks. Next.js allowed me to decide which components could be rendered on client or server side; hence, reduce the workload on users’ devices and boost performance significantly.\n\n I opted for TailwindCSS to create a design that can adapt to various devices, address the need for mobile friendly interfaces without relying heavily on custom CSS. Furthermore, I utilized Shadcn/ui to design complicated UI components such as tables and alert dialogs. This tool offers visual appeal and reduces 100 lines of HTML tags. Moreover, I integrated Clerk, a third party API known for its user features in managing user roles and authentication processes. This integration helped with the content management system for administrators. I was able to eliminate the hustle of writing extensive front-end code for user roles or authentication. Since using Clerk is my own decision, I was responsible for designing its data schema and writing backend logic for Clerk to connect to our database. During the development process, I encountered limitations with the existing prototype, particularly concerning the database’s storage capacity. This led me to suggest and redesign part of the UI; specifically, the third level of resource showing. I think this design could be an aspect providing a more suitable interface that met the evolving needs of the project.\n\n Taking a user centered approach, I added update and delete buttons directly on the resource section. This approach is different from my peer's initial one. I insisted on keeping this approach because it was inspired from my own experience using the app from a user aspect.\n\n My efforts culminated in an responsive DBP Online Portal that significantly enhanced user interaction. Leveraging Next.js’s server side rendering for quicker page loading times. Meanwhile, TailwindCSS ensured adaptability across devices. When starting off a project, I think the important key is to nail down the exact needs or wanted-outcomes of the project, that’s why spending enough time searching for the right frameworks or technologies is crucial. Once that’s sorted, diving into the project and coding gets a whole lot smoother because we’ve got the right tools in hand."
       },
       {
        "time": "2:15-2:30",
        "projectId": "csse-6-215",
        "title": "Conversation Game",
        "studentName": "Gerel Pasag",
        "studentMajor": "CSSE",
        "projectType": "Faculty research",
        "facultyAdvisor": "Dr. Annuska Zolyomi",
        "posterLink": "./posters/csse/pasaggerel_3750410_121296356_Conversation Game (1).png",
        "abstract": "For my capstone, I worked on designing a conversation game for neurodivergent individuals that establishes deeper connections thus creating a more inclusive and supportive environment. This is an emerging project in Professor Zolyomi’s IDEA Lab (Interaction Design for Education and Accessibility). My first step was to read research scholarly articles to gain a deeper understanding of how gaming and conversations are related and how we can implement that in our game. I also researched different game development platforms to see which one best fit our goal of what the game should be. User feedback played a crucial role in our research. Our team interviewed participants that are on the autism spectrum, members of the community, or people working with neurodivergent individuals. From our interviews, we extracted the data to an affinity diagram finding common themes such as: use cases, design, mechanics, lived experiences with communication challenges emotions, and concerns. The results from these interviews were beneficial in our research by getting opinions and concerns that the lab and I haven’t even thought about considering.\n\n As we got further data from our feedback interviews, we were able to start designing prototypes of our game. We started off with low-fidelity prototypes with sketches and other activities that encouraged brainstorming. Additionally, I looked at other conversation games on the current market, then designed an analog with a set of rules, game pieces and cards.\n\n Along with all the research findings, we are compiling our data into an Overleaf document. Our next steps are to complete and review our paper to submit it as a short-paper to a human-computer interaction conference.\n\n"
    },
    {
        "time": "2:30-2:45",
        "projectId": "csse-6-230",
        "title": "Game Design for Inclusive Conversation ",
        "studentName": "Kendra Walker",
        "studentMajor": "CSSE",
        "projectType": "Faculty research",
        "facultyAdvisor": "Dr. Annuska Zolyomi",
        "posterLink": "./posters/csse/walkerkendra_4027192_121287851_Walker_Poster.png",
        "abstract": "The aim of the project was to create a conversation game that encourages inclusive communication and social connection. A key element is emphasizing collaboration with the autism community to ensure their voices and perspectives have an integral influence in the creation of this game. This project expands upon the research work of Dr. Zolyomi from her paper “Designing for Common Ground: Visually Representing Conversation Dynamics of Neurodiverse Dyads” in which people with autism were asked to design a game centered around conversation. \n\n The main objective was to design a game system that allows players to explore the differences in the ways we experience conversation in a safe environment where non-conforming behaviors are welcome. This goal aimed to create a game that establishes an environment outside of implicit social norms where players can create their own environment to interact with each other in an equitable and comfortable space. Inclusive communication spans a broad range of needs and preferences, creating a game with fluid structures and mechanics would allow players to individualize their experiences and transform the game design to meet their needs at any given time.\n\n After receiving high level feedback from participants in a research study, their suggestions and concerns were addressed and incorporated into the design of a physical prototype. The prototype then served as a foundation for drafting a digital mockup. The next steps following these designs include reviewing, testing, and refining with the collaboration of the autism community, placing high importance on involving the community that the project is designed for. This project highlights how human-centered and value-sensitive design can create tools that support meaningful and inclusive interactions for neurodiverse communities. "
    },
    {
        "time": "2:45-3:00",
        "projectId": "csse-6-245",
        "title": "Whimsy Walks: Conversion from WebFlow to React",
        "studentName": "Resty Hernandez",
        "studentMajor": "CSSE",
        "projectType": "Faculty research",
        "facultyAdvisor": "Dr. Annuska Zolyomi",
        "posterLink": "./posters/csse/hernandezresty_4262381_121237773_Poster Capstone Resty Hernandez.png",
        "abstract": "I worked on the Whimsy Walks project as part of the IDEA Lab (Interactive Design for Education and Accessibility). Whimsy Walks is an online platform designed to encourage residents of the greater Seattle area to explore their neighborhoods and get exercise. A key focus of the project was integrating accessibility for wheelchair users through a page called Curated Walks. My role involved maintaining the website, including updating and adding content. Additionally, I was responsible for migrating the project from the Webflow platform to React and creating new database backend in PostgreSQL.\n\n Throughout my capstone, I had weekly meetings with the site's stakeholders. These meetings involved their expectations for the project and the site’s plans for the future. These meetings taught me how to meet and understand user requirements.\n\n We decided to migrate platforms because the site owner had larger ambitions for the project. Keeping it on Webflow, which lacks a code base, would have been challenging. Furthermore, managing content within Webflow was inefficient. Creating a new relational database made it easier to add and manage data on the platform. \n\n The platform migration involved multiple steps. First, I redesigned the database using PostgreSQL. Next, I exported the platform’s current data to the new database, which involved writing scripts and cleaning up data. Finally, I created the React application and developed components using the new PostgreSQL database.\n\n By the end of my time working on this project, I was able to successfully start the migration. I created a new database, transferred the data, and developed React components with the new database. This groundwork will facilitate easier future development, enabling future developers to continue porting the rest of the project to React. "
    },
    {
        "time": "3:00-3:15",
        "projectId": "csse-6-300",
        "title": "Guide Communication: Designing Effective Tutorial Modes for AAC Devices",
        "studentName": "Linh Huynh",
        "studentMajor": "CSSE",
        "projectType": "Faculty research",
        "facultyAdvisor": "Dr. Annuska Zolyomi",
        "posterLink": "./posters/csse/huynhlinhha_3971692_121274152_LinhHuynh_Capstone Poster (36x24).png",
        "abstract": "The augmentative and alternative communication (AAC) project is a part of IDEA lab instructed by Professor Annuska Zolyomi. The project aims to research and create an application to help non-speaking individuals communicate in various settings (school, work, social gatherings). It functions as a voice assistant for users to speak out their thoughts, their needs, and their feelings.\n\n Firstly, we conducted thorough research by administering surveys and interviews. Participants included both AAC users and those unfamiliar with AAC technology. By leveraging Google Forms and the Discord AAC server, we gained valuable insights into their perspectives, needs, and pain points related to AAC devices. Next, we employed Dedoose, a qualitative data analysis software tool, to analyze the collected data. This process allowed us to identify functional categories specific to AAC devices. By evaluating the pros and cons of existing features, I pinpointed areas for improvement.\n\n Based on the insights from interviews, I developed a design direction aimed at addressing common pain points. To facilitate user adaptation, I designed a tutorial mode prototype. This prototype guided users through essential features, making the learning process smoother. I then conducted usability testing with my AAC group and classmates, incorporating their feedback to refine the design iteratively. Recognizing that not all users are beginners, I introduced shortcut tutorials for emergency and context awareness features. These allow experienced users to quickly access specific features without going through the entire tutorial.\n\n The tutorial mode is important in empowering users and facilitating their familiarity with AAC devices. Providing clear instructions and guided training, ensures that users can confidently navigate their devices and advocate for their communication needs. When individuals understand their AAC tools thoroughly, they become active participants in conversations, interactions, and self-expression.\n\n In summary, my capstone project contributes to a more accessible and user-friendly AAC experience. By addressing pain points, refining design, and incorporating user feedback, I hope to empower individuals who rely on AAC devices for communication. "
    },
    {
        "time": "3:15-3:30",
        "projectId": "csse-6-315",
        "title": "Developing Context-Aware Augmentative and Alternative Communication (AAC) Devices for Non-Verbal Autistic Individuals",
        "studentName": "Tumaresi Paresi",
        "studentMajor": "CSSE",
        "projectType": "Faculty research",
        "facultyAdvisor": "Dr. Annuska Zolyomi",
        "posterLink": "./posters/csse/TumaresiParesi.png",
        "abstract": "The AAC Conversation App is developed to improve text-to-speech communication by non-verbal individuals, specifically those with autism, by adding context awareness to current AAC devices. The main objective of this project is to enrich the current text-to-speech quality of current AAC devices in the market, like AssistiveWare's Proloquo2Go, to be able to support fundamental text-to-speech communications but through adaptation to specific user location, time, and emergency scenario. This project is therefore aimed at developing a context-aware AAC iOS prototype toward solving some of these inadequacies.\n\n Throughout the project, a teammate and I worked as full-stack developers. Our project began with comprehensive project management, review of existing documentation, setting up the necessary software and codebase, and basic skills acquisition in iOS development and database management. We develop the technical specifications, including detailed diagrams and implementation guides, collaboratively, just to ensure proper growth. \n\n The bulk of my work was in the context-aware improvement of the AAC application, which adds symbols to support a wide range of situations and maps them into different room contexts: kitchen, bathroom, living room, and bedroom. Many technical problems were also solved: organization of assets and symbol display. I have also enhanced the emergency mode by adding functionalities like the \"Alert all contacts\" button, optimized the visibility and functioning of emergency symbols. \n\n The testing demonstrated that context-aware enhancements will significantly improve the experience for the user, as the symbols provided would be relevant at that time to enable successful and fast communication. The emergency mode also ensures better preparedness in critical situations. \n\n It is essential to design personalized and context-adaptive AAC devices for helping non-verbal individuals. Our objective is to make communication easy, natural, and intuitive by using AAC technology to render devices appropriate for the environment at the time of use. "
    },
    {
        "time": "3:30-3:45",
        "projectId": "csse-6-330",
        "title": "Voice Unlocked: Experimental iOS App for Non-Verbal Speakers",
        "studentName": "Yasmine Subbagh",
        "studentMajor": "CSSE",
        "projectType": "Faculty research",
        "facultyAdvisor": "Dr. Annuska Zolyomi",
        "posterLink": "./posters/csse/subbaghyasminedestinynhu_4009326_121172504_Capstone Poster (CANVAS) (36 x 24 in)-2.png",
        "abstract": "Augmentative and Alternative Communication (AAC) devices are a tool used by non-verbal speakers. AAC users include children and adults with speech and language impairments due to autism spectrum disorder, down syndrome, speech delays, traumatic brain injury, post-surgical, stroke, and more. Traditional commercially available AAC devices lack the ability to adapt to changing contexts such as location and time of day. By incorporating context aware features, communication for users can be faster and simpler. The prototype device aims to provide more relevant suggestions (or predefined vocabulary) to the user’s current environment and activities. \n\n During my time aiding the UWB IDEA Lab research team, I developed an AAC device with context aware functionality. This project involved designing and implementing a relational database in conjunction to bringing the existing application up to a minimum viable product state. The new database allowed for the context aware functionality to operate and enabled reusability and robustness across the rest of the application. While the goal in the future is to have beacons in rooms to automatically identify a user’s location; within the AAC app, users are able to select the room and time which will in turn automatically modify the preset vocabulary to allow faster vocab retrieval by the user. \n\n While this is a multi-phase project, significant progress has been made with a AAC prototype that is now ready for a usability study by expert users on the wants and needs regarding the context aware functionality and more experimental features to come. The goal of the research being conducted it so enrich the conversations of AAC users and make communication more intuitive and fluid. "
    },
    {
        "time": "3:45-4:00",
        "projectId": "csse-6-345",
        "title": "iCare: Mental Health Chatbot",
        "studentName": "Tammy Le",
        "studentMajor": "CSSE",
        "projectType": "Faculty research",
        "facultyAdvisor": "Dr. Annuska Zolyomi",
        "posterLink": "./posters/csse/Tammy Le's Capstone Poster (iCare) 48x36 Spring 2024 [FINAL].jpeg",
        "abstract": "The iCare Project, part of Professor Zolyomi’s IDEA Lab in collaboration with Professor Si’s DAIS Lab, aims to enhance mental health support through empathetic and accessible interaction design. iCare is an AI therapy assistant designed to provide mental health resources and empathetic support. From IDEA lab, our goal is to specifically tailor for users with autism spectrum disorder (ASD) and attention-deficit/hyperactivity disorder (ADHD).\n\n Over two academic quarters, I have focused on user experience (UX) design for the iCare chatbot for neurodivergent individuals. The project began with a comprehensive literature review on the experiences of autistic individuals with AI chatbots and relevant UX design principles. I have developed the research study plan. This research was supplemented by hands-on testing of popular AI chatbots to evaluate the effectiveness of various UI elements such as avatars and animations.\n\n Based on these insights, I developed UI guidelines to improve the clarity and format of the chatbot's responses. I created personas and customer journey maps to understand user needs and experiences better. Additionally, I conducted color-coded data analysis using Excel and performed a heuristic evaluation to inform the redesign process. In winter of 2024, I conducted pilot user studies with Professor Zolyomi and a teammate to gather initial feedback on the prototype's user experience. These studies revealed a need for more expressive elements and enhanced conversational skills to engage users effectively. In the spring of 2024, I conducted another design session (usability testing) to gather further data on improving functions and features, such as summary takeaways and detecting mood/empathy from users.\n\n Utilizing this feedback, I created a high-level fidelity Figma prototype for the next version of the iCare chatbot's UI. This prototype is designed to meet the needs of autistic individuals, incorporating features such as chunked information, clear and concise responses, and visual cues to convey empathy. These design elements aim to rceduce cognitive load and enhance the overall user experience.\n\n This work is critical as neurodiverse individuals often encounter significant barriers in accessing traditional mental health support due to sensory sensitivities and communication challenges. By addressing these issues, the iCare Project strives to provide a more equitable and effective mental health resource.\n\n The project will continue in subsequent quarters, with further requirements likely to include additional user research and usability testing with neurodiverse participants. This ongoing work will ensure that the iCare platform evolves based on user feedback and best practices in accessibility and interaction design, ultimately contributing to more inclusive mental health support tools"
    },
    {
        "time": "4:00-4:15",
        "projectId": "csse-6-400",
        "title": "Implementing ConverSwim: A Full Stack Web Application",
        "studentName": "Kayden Grant",
        "studentMajor": "CSSE",
        "projectType": "Faculty research",
        "facultyAdvisor": " Dr. Annuska Zolyomi",
        "posterLink": "./posters/csse/grantkaydenalexander_4008012_121301749_CapstonePoster_KaydenGrant.png",
        "abstract": "Dr. Zolyomi has been conducting research in understanding conversational patterns between neurodiverse and neurotypical pairs at the University of Washington. Through her research, she has specifically found that placing ambiguous images within swimlane diagrams can be incredibly effective to depict emotions and find common ground between the pair. All of the research data has been sourced from Dr. Zolyomi, who facilitates her studies using a paper prototype of the swimlane diagrams and accompanying images. While the paper prototype initially worked, Dr. Zolyomi needed to transform it into an application to assist with her research in the short term. Long term, Dr. Zolyomi plans to scale the application into a universal tool, in order to significantly improve the quality of conversations between neurodiverse and neurotypical people.\n\n During my freetime outside of the University of Washington Bothell, I have been learning and developing my skills in full stack development using JavaScript. So For my capstone project, I transformed the paper prototype into a full stack web application using many familiar tools and technologies. \n\n I managed to implement user authentication and develop the two main features of the application: the swimlane canvas and journal. Initially, I reviewed the documents that have been created by previous research students in order to create an entity relationship diagram for the database schema and outline the custom RESTful API endpoints. Then I practiced test driven development by creating unit tests for the API so that as I was implementing the endpoints, I could assess that it was working as intended before moving on. Lastly, I implemented the front end using React.js, tying everything together. Throughout the development of the application, I ran into a few bugs and errors leading me to either simplify the feature or write unoptimized code in order to get it to work. With the limited amount of time on the project, my goal was to get the core concepts functional and leave the extra features and optimizations for the next set of research students that carry on the project. All together, I am very proud of the work that I managed to accomplish and I am extremely grateful to Dr. Zolyomi and the other students in the IDEA Lab for their contributions and support. \n\n"
    },
    {
        "time": "4:15-4:30",
        "projectId": "csse-6-415",
        "title": "IT Infrastructure Development - Zumiez Inc.",
        "studentName": "Filo Henein",
        "studentMajor": "CSSE",
        "projectType": "Internship or Job opportunity",
        "facultyAdvisor": "Dr. Annuska Zolyomi",
        "posterLink": "./posters/csse/heneinfilobatire_4283953_121213866_1717228901.352428.jpg",
        "abstract": "For my capstone project, I completed an internship at Zumiez INC in Lynnwood, focusing on IT infrastructure development. Zumiez Inc., founded by Thomas Campion and Rick Brooks, is an American multinational specialty clothing store known for its unique retail experience. The purpose of my internship was to enhance Zumiez's technological capabilities and operational efficiency.\n\n During my internship, I developed and refined Zumiez applications to improve functionality and user experience. I also migrated these applications to cloud-based platforms to enhance scalability, security, and accessibility. Additionally, I identified and implemented technological solutions to streamline business processes and provided technical support for hardware, telephony, network infrastructure, and both application and web-based platforms. To keep my skills sharp, I completed coding challenges, such as developing a maze solver from scratch.\n\n The result of my efforts was the successful enhancement of Zumiez's IT infrastructure, which improved operational efficiency and user experience. My contributions ensured that the company's technological systems were more robust, secure, and scalable. The significance of this work lies in its impact on Zumiez's ability to support its growing business needs with advanced technological solutions. This experience also prepared me for future roles in IT and infrastructure development, enabling me to contribute effectively to technological innovation and operational excellence. "
    }
    ]
}


