

{
    "csse": [
      
        {
           "time": "2:00-2:15",
           "projectId": "csse-7-200",
           "title": "Brushstrokes Through Time: Zeng's Calligraphy In Virtual Reality",
           "studentName": "Wayne Zeng",
           "studentMajor": "CSSE",
           "projectType": "Internship or Job opportunity",
           "facultyAdvisor": "Dr. Arkady Retik",
           "posterLink": "./posters/csse/zengwayne_3775902_121214450_UWB CSS497 ZhihuiZeng SP2024 (lowerResolution).png",
           "abstract": "This is a self-defined capstone project. The main aim of this capstone project was to design and develop an immersive virtual reality experience titled \"Brushstrokes Through Time.\" This project focused on showcasing the exquisite calligraphy of Mr. Zeng, integrating traditional Chinese art with contemporary VR technology. By digitizing Mr. Zeng's calligraphy, the project preserves and honors his artistic legacy, offering an engaging educational platform that introduces users to the history and techniques of Chinese calligraphy.\n\n The first step in building the virtual reality experience was to research existing VR technologies and methods for digitizing calligraphy, ensuring an accurate representation of Mr. Zeng's work. Emphasis was placed on balancing performance and authenticity to create a seamless and immersive user experience. Once the appropriate techniques were identified, the next step involved designing and coding the VR environment using Unity, a great platform for VR development thanks to the XR Tool kit. The project also uses Blender for 3D modeling, Substance for texture, Photoshop to enhance the artwork, and Figma for the introduction poster.\n\n In addition to the technical aspects, the project also involved collaborating with artists, technologists, and cultural experts to ensure the accuracy and cultural significance of the content. The VR experience not only showcases Mr. Zeng's calligraphy but also narrates his personal story, providing an emotional connection and promoting cultural exchange. Interactive features allow users to engage closely with the art, revealing the stories behind Mr. Zeng's pieces and the beauty of Chinese calligraphy.\n\n The project demonstrates the potential of harmonizing traditional arts with modern technology, fostering innovation in both fields. By creating an immersive and interactive VR experience, \"Brushstrokes Through Time\" serves as an inspiration for artists and technologists alike, showcasing the endless possibilities of digital preservation and cultural education. "
       },
       {
        "time": "2:15-2:30",
        "projectId": "csse-7-215",
        "title": "Internship at Apexiel",
        "studentName": "Natha Chiu",
        "studentMajor": "CSSE",
        "projectType": "Internship or Job opportunity",
        "facultyAdvisor": "Dr. Arkady Retik",
        "posterLink": "./posters/csse/chiunatha_4007171_121279856_capstone_final_poster.jpg",
        "abstract": "I interned as a software engineer at Apexiel. It is a platform connecting car enthusiasts with photographers. This internship aimed to enhance the user experience by leveraging computer vision techniques. Photographers can post photos of a racing event in a gallery on the Apexiel website, which the customers can purchase; however, some images do not have a watermark, so the images can be downloaded free of charge. \n\n To address this issue, I learned how to use OpenCV to add logo images as watermarks with adjustable transparency. In addition, there can be many images of different cars associated with an event, and the customers can have difficulty finding the right images, so Apexiel wants to provide a way to filter the images by the make and model of a car. I was tasked to research and develop a neural network to classify the make and model of a car, which is an ongoing effort. During the internship, I learned how to use PyTorch and created protypes of the AI using various neural network architectures, such as ResNet and Vision Transformer. Due to the lack of readily available dataset of labeled car images that suits the needs of this project, I chose to use python libraries, such as Beautifulsoup and Selenium, to scrape car images and parse the web pages to create labels. This internship was successful in starting the development of automatic labeling and adding watermarks to pictures. "
    },
    {
        "time": "2:30-2:45",
        "projectId": "csse-7-230",
        "title": "Automating Educational Assessments with AI-Powered Quiz Generation",
        "studentName": "Andrés Lince",
        "studentMajor": "CSSE",
        "projectType": "Individual project - Student defined",
        "facultyAdvisor": "Dr. Arkady Retik",
        "posterLink": "./posters/csse/linceandres_4026321_121253422_Poster.jpg",
        "abstract": "As part of my individual capstone project, I designed and implemented a system that generates a set of questions from any text source material. This work comes as a response to the evolving needs of educational environments for versatile and scalable teaching tools. This system, called QGEN, has two integral components: the QGEN API and the QGEN Web App, which together facilitate the generation of customized quizzes tailored to diverse learning contexts.\n\n The QGEN API utilizes OpenAI's GPT-3.5 Turbo model to parse and convert textual content into various question types, harnessing advanced natural language processing techniques to ensure relevance and educational value. This capability is supported by a robust technical infrastructure built with Spring, enabling seamless RESTful interactions and efficient data handling.\n\n Simultaneously, the QGEN Web App, developed using GlassFish and JSF, offers an intuitive interface that allows educators and students to easily specify quiz parameters, generate quizzes, and engage interactively with the generated content. The application’s design is further enhanced by Bootstrap, which ensures a responsive and accessible user experience.\n\n Functional testing of the QGEN system has shown its effectiveness in producing quizzes that are not only accurate and aligned with user inputs but also diverse in terms of question difficulty and type. This adaptability makes QGEN particularly suitable for integration into various Learning Management Systems (LMS), where personalized educational tools are increasingly crucial.\n\n The significance of QGEN lies in its potential to transform educational methodologies through technology. By automating the quiz generation process and enabling interactive engagement, QGEN supports personalized learning experiences, accommodates diverse educational strategies, and potentially enhances student outcomes. Looking forward, the system is poised for further enhancements, including broader integration capabilities and the inclusion of more interactive elements, which will continue to advance its utility in educational settings. "
    },
    {
        "time": "2:45-3:00",
        "projectId": "csse-7-245",
        "title": "Resource and Online Library - Prifina Internship",
        "studentName": "Selina Nguyen",
        "studentMajor": "CSSE",
        "projectType": "Internship or Job opportunity",
        "facultyAdvisor": "Dr. Arkady Retik",
        "posterLink": "./posters/csse/Selina_FinalPoster .png",
        "abstract": "For this capstone project, I worked as a software engineering intern at a data company called Prifina. They are based in Silicon Valley and prioritize giving users full control over their own data, Prifina is a company where \"data is owned by individuals themselves\" \n\n As an intern at Prifina, I worked on designing and implementing the Learn More section of my team’s project, Ovul. Ovul is a desktop platform hosted on Prifina’s site to assist women in keeping track of their menstrual cycles in a private and protected manner. The purpose behind Ovul is to allow women to safely log and track their period cycles and symptoms without the risk of their information being collected or sold. My contribution to the project is the Learn More section and Ovul Library.\n\n The Learn More section allows users to gain deeper insight into their top 3 period symptoms and recommends articles contributing to their understanding of the causation and potential treatment options. Ovul’s latest feature, the Ovul Library, is an online library where the user’s favorite articles can be easily accessed. By including readily available sources for the user to read, they can use the sources as a way to ease any anxiety or stress correlated with the experience of the symptom as well as practice better habits or remedies to treat and minimize the impact of the symptom, leading to an enhanced quality of life all while knowing their data is protected.\n\n This section was designed and prototyped in Figma and developed using React for front-end components, Express for the backend, and MongoDB as the database for article storage. This project involved collaboration with Prifina’s design and development team where the main tasks included attending meetings, communicating and documenting work, and gaining approval for each design iteration."
    },
    {
        "time": "3:00-3:15",
        "projectId": "csse-7-300",
        "title": "Tanoor Software Project Management Internship",
        "studentName": "Abdulaziz Aladwan",
        "studentMajor": "CSSE",
        "projectType": "Internship or Job opportunity",
        "facultyAdvisor": "Dr. Arkady Retik",
        "posterLink": "./posters/csse/aladwanabdulazizmazen_4233398_121286832_Screenshot 2024-06-03 at 1.53.18 PM.png",
        "abstract": "Throughout the duration of the internship, I worked to design improvements on an existing POS at Tanoor. These design requirements ranged from simple features that improved user experience to more complex features to improve search algorithms. This project originally began while I was working at Tanoor as a server and noticed several bugs and design flaws within the POS that could be easily fixed. I found that these were being overlooked because everyone who was working at Tanoor was already so familiar with the system. I took the opportunity to improve the system by passing design requirements to my manager. He was so happy with the suggestions that he decided to make this into an ongoing project for me to work on.\n\n To address these issues, I began by collecting detailed requirements from both front and back of house staff. I conducted interviews and observations to understand their pain points and gathered feedback on their daily interactions with the POS system. Based on this information, I produced specifications that outlined the necessary improvements and new features. I then designed the enhancements to better meet the needs of the staff. Throughout the project, I tested the software to ensure the new features worked as intended, and made adjustments based on user feedback.\n\n The result of this project was a vast improvement within the systems usability and functionality. With the requirements passed, we improved on the accuracy of payroll, made it easier to do simple tasks for front of house staff and even made it easier to make orders for the back of house staff.\n\n Overall, there was a tremendous improvement within the system's functionality that has and will continue to have a strong impact on restaurant processes. This project had significance to the restaurant employees, management, and owner that will continue to live on as they franchise the store."
    },
    {
        "time": "3:15-3:30",
        "projectId": "csse-7-315",
        "title": "",
        "studentName": "Alex Salley",
        "studentMajor": "CSSE",
        "projectType": "Faculty Research",
        "facultyAdvisor": "Dr. Arkady Retik",
        "posterLink": "",
        "abstract": "As a member of the Quasar Research Group at UW Bothell my capstone aimed to develop a software application searching for instances of strange variability in quasar spectra.\n\n Quasars are one of the most luminous kinds of objects in the known universe. They consist of a supermassive blackhole at the center with a surrounding luminous accretion disk. Quasars can expel clouds of gas outwards, which are called outflows. All outflows have been found to be variable between observations, but the exact cause of this variability is unknown. While carrying out a previous study of quasar outflow variability, we found that several cases have a common minimum flux value but vary almost everywhere else within their absorption trough; we call this ‘strange’ variability. Its importance is that it can help us constrain the cause of variability since it sets restrictions on several absorption parameters, giving insight into the physical properties of the outflow.\n\n I used our preexisting pipeline written in Python to normalize quasar spectra and detect outflows. I also wrote my own tool in Python using Astropy, Astroquery, Pandas, and Numpy which analyzes quasar spectra and identifies instances of strange variability. I used Astropy, Pandas, and Numpy because our research group has already used these technologies. I also used Astroquery because it had an incredibly simple API for accessing astrophysical databases, and handled things like file caching automatically.\n\n I also helped develop a library for displaying scientific data using Python, Matplotlib, Google Colab, and Google Drive’s API. We felt that it was necessary to write this because our previous solution did not follow DRY and object-oriented principles, limited customization, obscured valuable information, and made producing graphs overly time consuming. I used Google’s API because it helped facilitate online collaboration, which is mostly done in Google Drive.\n\n My plotting library helped cut a Python script down from over 300 LOC to under 170 LOC with an increase in functionality. Its outputs were used for a grant proposal written by a faculty member of UW Bothell. Using my ‘strange variability detection’ tool I have analyzed over 16,000 different quasar spectra, and I have identified over 300 potential instances of strange variability. My research group and I are planning on performing followup research on the physical properties of quasar outflows, and we hope to publish a paper in the Astrophysical Journal. "
    },
    {
        "time": "3:30-3:45",
        "projectId": "csse-7-330",
        "title": "Volunteer Management System (VMS)",
        "studentName": "Siraj Dabbagh",
        "studentMajor": "CSSE",
        "projectType": "Internship or Job opportunity",
        "facultyAdvisor": "Dr. Arkady Retik",
        "posterLink": "./posters/csse/Siraj Dabbagh poster.png",
        "abstract": "The Volunteer Management System (VMS) project aimed to develop an innovative, user-friendly, and costless software solution specifically tailored to the needs of nonprofit organizations. This system addressed the common challenges faced by nonprofits in managing volunteer coordination, engagement, and operational efficiency. By offering a sector-specific VMS free of charge, the project is meant to empower nonprofits to streamline their volunteer management processes, enhance volunteer satisfaction, and maximize their societal impact.\n\n During this capstone project, a comprehensive needs assessment was conducted in collaboration with various nonprofit organizations to identify their unique volunteer management requirements. Based on these insights, a user-friendly VMS was designed and entered development. This VMS features functionalities such as volunteer shift scheduling, real-time communication, task assignments, feedback mechanisms, and data analytics.\n\n The primary purpose of this project was to address the inefficiencies caused by existing VMS solutions, which are often expensive, complex, and not well-suited for nonprofits. By creating a costless and intuitive VMS, the project aimed to reduce administrative burdens, optimize resource allocation, and improve volunteer engagement and retention rates. This initiative was driven by the need to provide financially constrained nonprofits with a high-quality tool that enhances their ability to manage volunteers effectively and achieve their missions. \n\n The VMS project successfully streamlined volunteer onboarding by implementing an automated registration and scheduling system, reducing manual input by 50% and onboarding time from hours to minutes. Enhanced reporting features allow nonprofit managers to generate customizable reports on volunteer activities, enabling better resource allocation and strategic planning. Operational efficiency increased by 30% with a responsive interface built with React and Tailwind CSS, streamlining tasks like scheduling and communication. User satisfaction was high, with a score of 9 out of 10, due to the system's ease of use and real-time communication features. \n\n The significance of this project lies in its potential to transform volunteer management practices within the nonprofit sector. By offering a free, intuitive, and tailored VMS, the project not only alleviates financial pressures on nonprofits but also empowers them to optimize their volunteer programs. This, in turn, enhances their overall impact on society and contributes to positive social change. The VMS project serves as a model for how technology can be leveraged to support and strengthen the nonprofit sector "
    },
    {
        "time": "3:45-4:00",
        "projectId": "csse-7-345",
        "title": "Gekko Health Application",
        "studentName": "Shumin Mok",
        "studentMajor": "CSSE",
        "projectType": "Internship or Job opportunity",
        "facultyAdvisor": "Dr. Arkady Retik",
        "posterLink": "./posters/csse/mokshumin_4265240_121258304_Capstone Poster_Shumin.png",
        "abstract": "My software engineering internship was at Gekko Corporation which provides services such as IT operations, security, business analytics, and health. They focus on developing applications for retrieving and aggregating data from a wide variety of wearable and IoT health devices. I have been working on implementing taking in health data from a variety of IoT devices, like an Apple Watch, and then grouping the data and summarizing it in order to generate reports using LLM. I had also to integrate dashboards, which provide a comprehensive view of important health metrics. \n\n The health mobile app, which I was working on with my team members, consists of four pages, one of which is a trend page, which shows the weight chart and the heart rate chart. With that said, one of the problems that we worked on was figuring out what other modifications could be made to the chart in order to provide more beneficial information for the user. \n\n In addition, the AI chat page is supposed to generate and answer any questions that the user has about their health report. Currently, we have inserted the ChatGPT API key into the front end without encoding it, and it works. However, the chat page will not work once I try to encrypt the ChatGPT API key. Therefore, we will be moving the API key criteria to the backend. The Gekko Health App will need Apple HealthKit capabilities to retrieve real-time data from other devices. Lastly, one other requirement for the application is to create a login and signup page. \n\n HealthKit provides a central repository for health and fitness data on the iPhone and Apple Watch. The app will be allowed to communicate and retrieve data through HealthKit. Other than collecting and storing data, HealthKit will be able to analyze and visualize the data, which also enables social interactions. The health app helps us to correlate and visualize data within executive dashboards that’s integrated with Splunk. Furthermore, I have implemented the login and sign-up pages for the application using HTML, CSS, and JavaScript together with React. \n\n To summarize, the implemented health application can be used by doctors to help diagnose patients and potentially shorten the amount of time that nurses may need to write reports on patients. "
    },
    {
        "time": "4:00-4:15",
        "projectId": "csse-7-400",
        "title": "Global Garden",
        "studentName": "Brendan Frye",
        "studentMajor": "CSSE",
        "projectType": "Individual project - Student defined",
        "facultyAdvisor": "Dr. Laurie Anderson",
        "posterLink": "./posters/csse/Revised Global Garden (48 x 36 in) (2)(1).png",
        "abstract":"Global Garden seeks to be a method of connecting people through a simple shared activity. Through an interactive design process I have worked to refine the prototype of what a “community platform” may look like in the future. The design for this prototype has been inspired by large community events like r/Place, and cooperative farming games like Stardew Valley. Basic features such as planting and harvesting crops are performed locally in this current iteration of development. In the future, connecting this interface into a database will allow for community engagement within the shared space.\n\n Throughout this Individual Capstone project, I set out to learn how to use a variety of tools unfamiliar to me based on previous coursework. By placing a heavy focus on front-end development I have prepared myself for future work adjacent to this project. When making decisions for the direction of the game, new functionalities were tested to see if one design would compliment existing designs compared to others. Rather than leveraging existing libraries or tools to facilitate the development of the Global Garden prototype, many of its functions are built from the ground up. From displaying the map, to creating menus for the user, every action is facilitated through custom systems.\n\n Global Garden taught me some important lessons which I can carry into my future career, and as I work on hobbies moving forward. User feedback ended up being an essential resource when fine tuning the design of the Canvas, as it was important to iterate and get a fresh set of eyes on the existing work periodically. Gradually refining the design piece by piece helped to address various issues like viewport offset before these issues impacted development later on. While the current implementation of the game is not finalized, there is a foundation in place for future development and release in the future. "
    }
    ]
}


